marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Base_TS_T40D2M10I1R0/include/Adc_MemMap.h
#ifdef ADC_START_SEC_CONST_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONST_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONST_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CONST_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONST_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONST_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CONST_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONST_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONST_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CONST_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONST_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONST_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CODE_SEG mcal_text
#endif

#ifdef ADC_STOP_SEC_CODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CODE_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_RAMCODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_RAMCODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CODE_SEG ramcode
#endif

#ifdef ADC_STOP_SEC_RAMCODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_RAMCODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CODE_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CODE_AC
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CODE_AC
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CODE_SEG acadc_code_rom
#endif

#ifdef ADC_STOP_SEC_CODE_AC
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CODE_AC
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma CODE_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_VAR_NO_INIT_BOOLEAN
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_VAR_NO_INIT_BOOLEAN
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma DATA_SEG mcal_bss
#endif

